# install brew taps
tap "buo/cask-upgrade"
tap "getantibody/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/services"

# install brew formulas
brew "ack"
brew "bash-completion"
brew "brew-cask-completion"
brew "coreutils"
brew "ctags"
brew "ctop"
brew "diff-so-fancy"
brew "docker-machine-driver-vultr"
brew "fdupes"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gdb"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "git-secrets"
brew "glib"
brew "gnupg"
brew "python"
brew "httpie"
brew "hub"
brew "node"
brew "jsonlint"
brew "lua"
brew "m-cli"
brew "mackup"
brew "mas"
brew "moreutils"
brew "pv"
brew "ruby"
brew "ssh-copy-id"
brew "thefuck"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "getantibody/tap/antibody"

# install brew cask apps
cask "appcleaner"
cask "atom"
cask "docker"
cask "dropbox"
cask "electrum"
cask "font-anonymous-pro"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "github"
cask "google-backup-and-sync"
cask "imageoptim"
cask "iterm2-beta"
cask "java"
cask "kap"
cask "keybase"
cask "launchrocket"
cask "now"
cask "postico"
cask "postman"
cask "robo-3t"
cask "sequel-pro"
cask "spectacle"
cask "transmission"
cask "visual-studio-code"
cask "vlc-nightly"

# install mac store apps
mas "1Password", id: 443987910
mas "Bitcoin Ticker", id: 998255317
mas "Decompressor", id: 1033480833
mas "Download Shuttle", id: 847809913
mas "Duplicate Detective", id: 686428787
mas "feedly", id: 865500966
mas "ForkLift", id: 412448059
mas "GIPHY CAPTURE", id: 668208984
mas "Highland 2", id: 1171820258
mas "hisuite", id: 1232508288
mas "Install macOS Mojave", id: 0
mas "IP Scanner", id: 404167149
mas "KankanMac", id: 897335960
mas "Local Cloud", id: 634034866
mas "MemoryFreer", id: 451682720
mas "MKPlayer", id: 1335612105
mas "Monit", id: 1014850245
mas "Movie Edit-Video Editor Video", id: 974355957
mas "Remote Desktop - VNC", id: 472995993
mas "Resizer", id: 411277085
mas "SmartConverter", id: 447513724
mas "Spy Cam", id: 438924363
mas "Telegram", id: 747648890
mas "Tumblr", id: 929285034
mas "Turn Off the Lights for Safari", id: 1273998507
mas "VOX", id: 461369673
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "虾米音乐", id: 673877994
